USE catalog_test;
SET NAMES utf8mb4;

INSERT INTO categories (id, name) VALUES
                                      (1, 'Ноутбуки'),
                                      (2, 'Монітори'),
                                      (3, 'Смартфони'),
                                      (4, 'Навушники'),
                                      (5, 'Аксесуари');

INSERT INTO products (category_id, name, price, created_at) VALUES
                                                                (1, 'HP 255 G10', 22999.00, '2026-02-20 09:00:00'),
                                                                (1, 'Acer Aspire 5', 19999.00, '2026-02-10 10:00:00'),
                                                                (1, 'Lenovo IdeaPad 3', 16999.00, '2026-01-25 12:30:00'),

                                                                (2, 'ASUS 27\" 165Hz', 9999.00, '2026-02-25 08:30:00'),
                                                                (2, 'Dell 24\" FHD', 5499.00, '2026-02-12 17:20:00'),
                                                                (2, 'LG 27\" IPS', 6999.00, '2026-02-05 09:00:00'),

                                                                (3, 'Samsung Galaxy A55', 15999.00, '2026-02-15 16:10:00'),
                                                                (3, 'Xiaomi Redmi Note 13', 8999.00, '2026-01-20 08:00:00'),
                                                                (3, 'iPhone 13 128GB', 19999.00, '2026-02-01 10:45:00'),

                                                                (4, 'Sony WH-CH720N', 4999.00, '2026-02-18 14:00:00'),
                                                                (4, 'Anker Soundcore Q30', 2999.00, '2026-02-01 10:45:00'),
                                                                (4, 'JBL Tune 760NC', 3499.00, '2026-01-30 11:10:00'),

                                                                (5, 'USB-C Hub 8-in-1', 1299.00, '2026-01-12 18:00:00'),
                                                                (5, 'Logitech MX Master 3S', 3999.00, '2026-02-22 13:00:00'),
                                                                (5, 'Кабель USB-C 2м', 299.00, '2026-02-08 09:20:00');